#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/PosTechFiap33/ControlePedido/runs/run-JAfsW5zHqAsYypAu

Waiting for the plan to start...

Terraform v1.9.6
on linux_amd64
Initializing plugins and modules...
aws_vpc.eks_vpc: Refreshing state... [id=vpc-09ef8265105bb08c5]
aws_subnet.eks_subnet_1: Refreshing state... [id=subnet-042233fb550c997fe]
aws_subnet.eks_subnet_2: Refreshing state... [id=subnet-0b1fa6d7652265c3f]
aws_eks_cluster.controle_pedidos_eks: Refreshing state... [id=controle-pedidos-cluster]
aws_eks_node_group.controle_pedido_node_group: Refreshing state... [id=controle-pedidos-cluster:controle-pedido-node-group]
aws_eks_cluster.controle_pedidos_eks: Drift detected (update)
aws_eks_node_group.controle_pedido_node_group: Drift detected (update)
aws_subnet.eks_subnet_1: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eks_node_group.controle_pedido_node_group must be replaced
-/+ resource "aws_eks_node_group" "controle_pedido_node_group" {
      ~ ami_type               = "AL2023_x86_64_STANDARD" -> (known after apply)
      ~ arn                    = "arn:aws:eks:us-east-1:752307938219:nodegroup/controle-pedidos-cluster/controle-pedido-node-group/f6c91b39-1007-7c1f-80e3-25e9cb0c9fc8" -> (known after apply)
      ~ capacity_type          = "ON_DEMAND" -> (known after apply)
      ~ disk_size              = 20 -> (known after apply)
      ~ id                     = "controle-pedidos-cluster:controle-pedido-node-group" -> (known after apply)
      ~ instance_types         = [
          - "t3.medium",
        ] -> (known after apply)
      - labels                 = {} -> null
      + node_group_name_prefix = (known after apply)
      ~ node_role_arn          = "arn:aws:iam::752307938219:role/LabRole" -> "arn:aws:iam::752307938219:role/aws-service-role/eks-nodegroup.amazonaws.com/AWSServiceRoleForAmazonEKSNodegroup"
      ~ release_version        = "1.30.4-20240924" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-controle-pedido-node-group-f6c91b39-1007-7c1f-80e3-25e9cb0c9fc8"
                    },
                ]
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
      ~ status                 = "CREATE_FAILED" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      ~ version                = "1.30" -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ update_config (known after apply)
      - update_config {
          - max_unavailable            = 1 -> null
          - max_unavailable_percentage = 0 -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @FlavioRoberto, Action: `pull_request`*